clear
close all
clc
format short g

A=[3 -1 1;3 6 2;3 3 7];                     %系数矩阵
b=[1;0;4];                                  %常数项矩阵
e=1e-3;                                     %误差限
w=1.2;                                      %松弛系数
x0=zeros(length(b),1);                      %初始值
[B,g,fan,X,k,lan,rho]=Songchi(A,b,e,w,x0)   %输出结果

  
A=[5 -4 0;-4 5 -1;0 -1 5];              %系数矩阵
b=[7;-3;3];                             %常数项矩阵
e=1e-4;                                 %误差限
w=1.2;                                  %松弛系数
x0=[0;0;0];                             %初始值
[~,~,~,X,k,~]=Songchi(A,b,e,w,x0)       %输出结果

A=[2 -1 1;1 1 1;1 1 -2];                %系数矩阵
b=[1;1;1];                              %常数项矩阵
e=1e-4;                                 %误差限
x0=[0;0;0];                             %初始值
[~,~,~,~,~,~,rho_J]=Jacobi(A,b,e,x0)
[~,~,~,~,~,~,rho_S]=Seidel(A,b,e,x0)    %输出结果