clear
close all
clc
format long

N=10000000;       %迭代次数
s=log(2)

s1(1,1)=1;     %算法5.1的初始值
e1(1,1)=1-log(2);
sgn=1;         %算法5.1式中第n个数的符号
for i=2:N                     %算法5.1
    sgn=sgn*(-1);             %每次迭代乘以-1，以减少幂函数的使用
    s1(1,i)=s1(1,i-1)+sgn/i;  %迭代计算ln2近似值
    e1(1,i)=s1(1,i)-log(2);  %绝对误差
end
s_1=s1(1,N)    %输出5.1式第N个迭代结果

s2(1,1)=2/3;   %算法5.2的初始值
e2(1,1)=2/3-log(2); 
a=1;           %5.2式中第n个数分母部分的2n-1
b=3;           %5.2式中第n个数分母部分的3^(2n-1)
for i=2:N                     %算法5.2
   a=a+2;                     %每次迭代加2，以减少乘法的使用
   b=b*9;                     %每次迭代乘以9，以减少幂函数的使用
   s2(1,i)=s2(1,i-1)+2/(a*b); %迭代计算ln2近似值
   e2(1,i)=s2(1,i)-log(2); %绝对误差
end
s_2=s2(1,N)   %输出5.2式第N个迭代结果

plot(s1); hold on; plot(s2) %在同一张图中绘制算法5.1及5.2的收敛过程
figure; plot(e1); hold on; plot(e2) %绝对误差曲线